//ДА-12-16 Ніколаєв Роман, CLion

#include <iostream>
#include <ctime>
#include <vector>

void remove_dupl(std::vector<int> &vec){
    for(int i = 0; i < vec.size(); i++){
        if(vec[i] == vec[i+1]){//якщо поряд стоять два однакових елементи, то один з них видаляється
            vec.erase(vec.begin()+i);
            i--;//I зменшується задля уникнення пропуску обробки елементів
        }//Пояснення: якщо не зменшити I, то після виделення елементу під індексом І, буде знаходитись минулий I+1,
    }    //який буде при наступній ітерації циклу порівнюватись з минулим I+2. Тобто елемент I+1 уникне обробки.
}

int main(){

    srand(time(NULL));
    int N;
    std::cout << "Введіть розмір масиву: ";
    std::cin >> N;//введення бажаного розміру масиву
    std::vector<int> vec;
    std::cout << "Початковий масив: ";
    for(int i = 0; i < N; i++){//заповнення масиву випадковими значеннями і його виведення
        vec.push_back(rand()%3+1);
        std::cout << vec[i] << " ";
    }

    remove_dupl(vec);//виклик ф-ції видалення дуплікатів, котрі стоять поряд

    std::cout << "\nРезультат: ";
    for(int i = 0; i <= vec.size(); i++){
        std::cout << vec[i] << " ";//виведення результату
    }
    return 0;
}